In [1]:
import warnings
warnings.filterwarnings("ignore")

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
calls = pd.read_csv('datasets/megaline_calls.csv')

In [4]:
messages = pd.read_csv('datasets/megaline_messages.csv')

In [5]:
internet = pd.read_csv('datasets/megaline_internet.csv')

In [6]:
users = pd.read_csv('datasets/megaline_users1.csv')

In [7]:
plans = pd.read_csv('datasets/megaline_plans.csv')

In [8]:
calls.head()

         id  user_id   call_date  duration
0   1000_93     1000  2018-12-27      8.52
1  1000_145     1000  2018-12-27     13.66
2  1000_247     1000  2018-12-27     14.48
3  1000_309     1000  2018-12-28      5.76
4  1000_380     1000  2018-12-30      4.22

In [9]:
calls.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 137735 entries, 0 to 137734
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   id         137735 non-null  object
 1   user_id    137735 non-null  int64
 2   call_date  137735 non-null  object
 3   duration   137735 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 4.2+ MB

In [10]:
messages.head()

         id  user_id message_date
0  1000_125     1000   2018-12-27
1  1000_160     1000   2018-12-31
2  1000_223     1000   2018-12-31
3  1000_251     1000   2018-12-27
4  1000_255     1000   2018-12-26

In [11]:
messages.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76051 entries, 0 to 76050
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            76051 non-null  object
 1   user_id       76051 non-null  int64
 2   message_date  76051 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.7+ MB

In [12]:
internet.head()

         id  user_id session_date  mb_used
0   1000_13     1000   2018-12-29    89.86
1  1000_204     1000   2018-12-31     0.00
2  1000_379     1000   2018-12-28   660.40
3  1000_413     1000   2018-12-26   270.99
4  1000_442     1000   2018-12-27   880.22

In [13]:
internet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 104825 entries, 0 to 104824
Data columns (total 4 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   id            104825 non-null  object
 1   user_id       104825 non-null  int64
 2   session_date  104825 non-null  object
 3   mb_used       104825 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 3.2+ MB

In [14]:
users.head()

,user_id,first_name,last_name,age,city,reg_date,plan,churn_date
0,1000,Anamaria,Bauer,45,"Atlanta-Sandy Springs-Roswell, GA MSA",2018-12-24,ultimate,NaN
1,1001,Mickey,Wilkerson,28,"Seattle-Tacoma-Bellevue, WA MSA",2018-08-13,surf,NaN
2,1002,Carlee,Hoffman,36,"Las Vegas-Henderson-Paradise, NV MSA",2018-10-21,surf,NaN
3,1003,Reynaldo,Jenkins,52,"Tulsa, OK MSA",2018-01-28,surf,NaN
4,1004,Leonila,Thompson,40,"Seattle-Tacoma-Bellevue, WA MSA",2018-05-23,surf,NaN

In [15]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     500 non-null    int64
 1   first_name  500 non-null    object
 2   last_name   500 non-null    object
 3   age         500 non-null    int64
 4   city        500 non-null    object
 5   reg_date    500 non-null    object
 6   plan        500 non-null    object
 7   churn_date  34 non-null     object
dtypes: int64(2), object(6)
memory usage: 31.4+ KB

In [16]:
plans.head()

,messages_included,mb_per_month_included,minutes_included,usd_monthly_pay,usd_per_gb,usd_per_message,usd_per_minute,plan_name
0,50,15360,500,20,10,0.03,0.03,surf
1,1000,30720,3000,70,7,0.01,0.01,ultimate

In [17]:
plans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 8 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   messages_included      2 non-null      int64
 1   mb_per_month_included  2 non-null      int64
 2   minutes_included       2 non-null      int64
 3   usd_monthly_pay        2 non-null      int64
 4   usd_per_gb             2 non-null      int64
 5   usd_per_message        2 non-null      float64
 6   usd_per_minute         2 non-null      float64
 7   plan_name              2 non-null      object
dtypes: float64(2), int64(5), object(1)
memory usage: 256.0+ bytes

In [25]:
#merge columns into users or join
#user_id, city, plan, call_date, duration, message_date, session_date, mb_used

In [26]:
data = users[['user_id', 'city', 'plan']]

In [27]:
data_calls = data.merge(calls, how='outer', on='user_id')

In [86]:
data_calls.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 137754 entries, 0 to 137753
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   user_id    137754 non-null  int64
 1   city       137754 non-null  object
 2   plan       137754 non-null  object
 3   id         137754 non-null  object
 4   call_date  137754 non-null  object
 5   duration   137754 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 7.4+ MB

In [35]:
data_messages = data.merge(messages, how='outer', on='user_id')

In [85]:
data_messages.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 76149 entries, 0 to 76148
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   user_id       76149 non-null  int64
 1   city          76149 non-null  object
 2   plan          76149 non-null  object
 3   id            76149 non-null  object
 4   message_date  76149 non-null  object
dtypes: int64(1), object(4)
memory usage: 3.5+ MB

In [39]:
data_internet = data.merge(internet, how='outer', on='user_id')

In [84]:
data_internet.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 104836 entries, 0 to 104835
Data columns (total 6 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       104836 non-null  int64
 1   city          104836 non-null  object
 2   plan          104836 non-null  object
 3   id            104836 non-null  object
 4   session_date  104836 non-null  object
 5   mb_used       104836 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 5.6+ MB

In [43]:
#fill in missing values

In [65]:
data_calls.isnull().sum()

user_id      0
city         0
plan         0
id           0
call_date    0
duration     0
dtype: int64

In [66]:
#data_calls.loc[data_calls.duration.isnull()].head()

Empty DataFrame
Columns: [user_id, city, plan, id, call_date, duration]
Index: []

In [56]:
data_calls['id'] = data_calls['id'].fillna(value=0)
data_calls['call_date'] = data_calls['call_date'].fillna(method='ffill')
# to have a date during conversion
data_calls['duration'] = data_calls['duration'].fillna(value=0)

In [76]:
data_messages.isnull().sum()

user_id         0
city            0
plan            0
id              0
message_date    0
dtype: int64

In [77]:
#data_messages.loc[data_messages.message_date.isnull()].head()

Empty DataFrame
Columns: [user_id, city, plan, id, message_date]
Index: []

In [71]:
data_messages['id'] = data_messages['id'].fillna(value=0)
data_messages['message_date'] = data_messages['message_date'].fillna(method='ffill')

In [81]:
data_internet.isnull().sum()

user_id         0
city            0
plan            0
id              0
session_date    0
mb_used         0
dtype: int64

In [82]:
#data_internet.loc[data_internet.id.isnull()].head()

Empty DataFrame
Columns: [user_id, city, plan, id, session_date, mb_used]
Index: []

In [80]:
data_internet['id'] = data_internet['id'].fillna(value=0)
data_internet['session_date'] = data_internet['session_date'].fillna(method='ffill')
data_internet['mb_used'] = data_internet['mb_used'].fillna(value=0)